Model: "train_flat_20-09-10-10-46"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 97, 3)        0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 97, 8)        80          input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 97, 11)       0           input_1[0][0]                    
                                                                 conv1d_1[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 97, 16)       544         concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 97, 27)       0           concatenate_1[0][0]              
                                                                 conv1d_2[0][0]                   
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 97, 32)       2624        concatenate_2[0][0]              
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, 97, 59)       0           concatenate_2[0][0]              
                                                                 conv1d_3[0][0]                   
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 97, 64)       11392       concatenate_3[0][0]              
__________________________________________________________________________________________________
concatenate_4 (Concatenate)     (None, 97, 123)      0           concatenate_3[0][0]              
                                                                 conv1d_4[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 11931)        0           concatenate_4[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 291)          3472212     flatten_1[0][0]                  
==================================================================================================
Total params: 3,486,852
Trainable params: 3,486,852
Non-trainable params: 0
__________________________________________________________________________________________________
