Model: "train_half_20-09-09-09-56"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, 97, 3)        0                                            
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 97, 8)        80          input_1[0][0]                    
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, 97, 11)       0           input_1[0][0]                    
                                                                 conv1d_1[0][0]                   
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 97, 16)       544         concatenate_1[0][0]              
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, 97, 27)       0           concatenate_1[0][0]              
                                                                 conv1d_2[0][0]                   
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 2619)         0           concatenate_2[0][0]              
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 291)          762420      flatten_1[0][0]                  
==================================================================================================
Total params: 763,044
Trainable params: 763,044
Non-trainable params: 0
__________________________________________________________________________________________________
